pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_build_assembly_code.cpp
//---------------------------------------------------------------------------*
//                                                                           *
//                   File 'pic18_build_assembly_code.cpp'                    *
//                        Generated by version 2.4.7                         *
//                       july 6th, 2013, at 9h58'39"                         *
//                                                                           *
//---------------------------------------------------------------------------*

//--- START OF USER ZONE 1


//--- END OF USER ZONE 1

#include "pic18_build_assembly_code.h"
#include "galgas2/C_Compiler.h"
#include "galgas2/C_galgas_io.h"
#include "galgas2/C_galgas_CLI_Options.h"
#include "utilities/C_PrologueEpilogue.h"

//---------------------------------------------------------------------------*

#include "piccoloDevice_grammar.h"

//---------------------------------------------------------------------------*

#ifndef DO_NOT_GENERATE_CHECKINGS
  #define SOURCE_FILE_AT_LINE(line) "pic18_build_assembly_code.gSemantics", line
  #define COMMA_SOURCE_FILE_AT_LINE(line) , SOURCE_FILE_AT_LINE(line)
#else
  #define SOURCE_FILE_AT_LINE(line) 
  #define COMMA_SOURCE_FILE_AT_LINE(line) 
#endif

//---------------------------------------------------------------------------*
//                                                                           *
//                    Routine 'pic18_build_assembly_code'                    *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_pic_31__38__5F_build_5F_assembly_5F_code (const GALGAS_string constinArgument_inProcessorName,
                                                       const GALGAS_registerTable constinArgument_inPredefinedRegisters,
                                                       const GALGAS_registerTable constinArgument_inAllRegisters,
                                                       const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constinArgument_inInstructionList,
                                                       const GALGAS_actualConfigurationMap constinArgument_inActualConfigurationMap,
                                                       GALGAS_string & outArgument_outAssemblyCode,
                                                       C_Compiler * inCompiler
                                                       COMMA_UNUSED_LOCATION_ARGS) {
  outArgument_outAssemblyCode.drop () ; // Release 'out' argument
  outArgument_outAssemblyCode = GALGAS_string ("  PROCESSOR ").operator_concat (constinArgument_inProcessorName COMMA_SOURCE_FILE_AT_LINE (541)).operator_concat (GALGAS_string ("\n") COMMA_SOURCE_FILE_AT_LINE (541)) ;
  outArgument_outAssemblyCode.dotAssign_operation (GALGAS_string (";--- Code\n") COMMA_SOURCE_FILE_AT_LINE (543)) ;
  outArgument_outAssemblyCode.dotAssign_operation (GALGAS_string ("  ORG 0\n") COMMA_SOURCE_FILE_AT_LINE (544)) ;
  GALGAS_uint var_bccLabelIndex = GALGAS_uint ((PMUInt32) 0U) ;
  cEnumerator_pic_31__38__5F_intermediate_5F_instructionList enumerator_16343 (constinArgument_inInstructionList, kEnumeration_up) ;
  while (enumerator_16343.hasCurrentObject ()) {
    GALGAS_stringlist var_lineList = GALGAS_stringlist::constructor_emptyList (SOURCE_FILE_AT_LINE (547)) ;
    callCategoryMethod_buildAssemblyCode ((const cPtr_pic_31__38__5F_intermediate_5F_instruction *) enumerator_16343.current_mInstruction (HERE).ptr (), var_lineList, var_bccLabelIndex, inCompiler COMMA_SOURCE_FILE_AT_LINE (548)) ;
    cEnumerator_stringlist enumerator_16472 (var_lineList, kEnumeration_up) ;
    while (enumerator_16472.hasCurrentObject ()) {
      outArgument_outAssemblyCode.dotAssign_operation (enumerator_16472.current_mValue (HERE).operator_concat (GALGAS_string ("\n") COMMA_SOURCE_FILE_AT_LINE (550)) COMMA_SOURCE_FILE_AT_LINE (550)) ;
      enumerator_16472.gotoNextObject () ;
    }
    enumerator_16343.gotoNextObject () ;
  }
  outArgument_outAssemblyCode.dotAssign_operation (GALGAS_string ("\n") COMMA_SOURCE_FILE_AT_LINE (553)) ;
  outArgument_outAssemblyCode.dotAssign_operation (GALGAS_string (";--- Prefefined registers\n") COMMA_SOURCE_FILE_AT_LINE (555)) ;
  cEnumerator_registerTable enumerator_16687 (constinArgument_inPredefinedRegisters, kEnumeration_up) ;
  while (enumerator_16687.hasCurrentObject ()) {
    GALGAS_uint var_firstRegister ;
    enumerator_16687.current_mRegisterAddressList (HERE).method_first (var_firstRegister, inCompiler COMMA_SOURCE_FILE_AT_LINE (557)) ;
    outArgument_outAssemblyCode.dotAssign_operation (enumerator_16687.current_lkey (HERE).reader_string (SOURCE_FILE_AT_LINE (558)).operator_concat (GALGAS_string (" EQU ") COMMA_SOURCE_FILE_AT_LINE (558)).operator_concat (var_firstRegister.reader_hexString (SOURCE_FILE_AT_LINE (558)) COMMA_SOURCE_FILE_AT_LINE (558)).operator_concat (GALGAS_string ("\n") COMMA_SOURCE_FILE_AT_LINE (558)) COMMA_SOURCE_FILE_AT_LINE (558)) ;
    enumerator_16687.gotoNextObject () ;
  }
  outArgument_outAssemblyCode.dotAssign_operation (GALGAS_string ("\n") COMMA_SOURCE_FILE_AT_LINE (560)) ;
  outArgument_outAssemblyCode.dotAssign_operation (GALGAS_string (";--- User defined registers (in RAM)\n") COMMA_SOURCE_FILE_AT_LINE (562)) ;
  cEnumerator_registerTable enumerator_17014 (constinArgument_inAllRegisters, kEnumeration_up) ;
  while (enumerator_17014.hasCurrentObject ()) {
    const enumGalgasBool test_0 = constinArgument_inPredefinedRegisters.reader_hasKey (enumerator_17014.current_lkey (HERE).reader_string (SOURCE_FILE_AT_LINE (564)) COMMA_SOURCE_FILE_AT_LINE (564)).operator_not (SOURCE_FILE_AT_LINE (564)).boolEnum () ;
    if (kBoolTrue == test_0) {
      GALGAS_uint var_firstRegister ;
      enumerator_17014.current_mRegisterAddressList (HERE).method_first (var_firstRegister, inCompiler COMMA_SOURCE_FILE_AT_LINE (565)) ;
      outArgument_outAssemblyCode.dotAssign_operation (enumerator_17014.current_lkey (HERE).reader_string (SOURCE_FILE_AT_LINE (566)).operator_concat (GALGAS_string (" EQU ") COMMA_SOURCE_FILE_AT_LINE (566)).operator_concat (var_firstRegister.reader_hexString (SOURCE_FILE_AT_LINE (566)) COMMA_SOURCE_FILE_AT_LINE (566)).operator_concat (GALGAS_string ("\n") COMMA_SOURCE_FILE_AT_LINE (566)) COMMA_SOURCE_FILE_AT_LINE (566)) ;
    }
    enumerator_17014.gotoNextObject () ;
  }
  outArgument_outAssemblyCode.dotAssign_operation (GALGAS_string ("\n") COMMA_SOURCE_FILE_AT_LINE (569)) ;
  outArgument_outAssemblyCode.dotAssign_operation (GALGAS_string (";--- Piccolo defined symbols\n") COMMA_SOURCE_FILE_AT_LINE (571)) ;
  outArgument_outAssemblyCode.dotAssign_operation (GALGAS_string ("W EQU 1\n") COMMA_SOURCE_FILE_AT_LINE (572)) ;
  outArgument_outAssemblyCode.dotAssign_operation (GALGAS_string ("BSR_ACCESS EQU 1\n"
    "\n") COMMA_SOURCE_FILE_AT_LINE (573)) ;
  const enumGalgasBool test_1 = GALGAS_bool (kIsStrictSup, constinArgument_inActualConfigurationMap.reader_count (SOURCE_FILE_AT_LINE (575)).objectCompare (GALGAS_uint ((PMUInt32) 0U))).boolEnum () ;
  if (kBoolTrue == test_1) {
    outArgument_outAssemblyCode.dotAssign_operation (GALGAS_string (";--- Configuration\n"
      "\n") COMMA_SOURCE_FILE_AT_LINE (576)) ;
    cEnumerator_actualConfigurationMap enumerator_17648 (constinArgument_inActualConfigurationMap, kEnumeration_up) ;
    while (enumerator_17648.hasCurrentObject ()) {
      outArgument_outAssemblyCode.dotAssign_operation (GALGAS_string ("  __config ").operator_concat (enumerator_17648.current_mRegisterAddress (HERE).reader_hexString (SOURCE_FILE_AT_LINE (578)) COMMA_SOURCE_FILE_AT_LINE (578)).operator_concat (GALGAS_string (", ") COMMA_SOURCE_FILE_AT_LINE (578)).operator_concat (enumerator_17648.current_mRegisterValue (HERE).operator_and (GALGAS_uint ((PMUInt32) 255U) COMMA_SOURCE_FILE_AT_LINE (578)).reader_hexString (SOURCE_FILE_AT_LINE (578)) COMMA_SOURCE_FILE_AT_LINE (578)).operator_concat (GALGAS_string ("\n") COMMA_SOURCE_FILE_AT_LINE (578)) COMMA_SOURCE_FILE_AT_LINE (578)) ;
      enumerator_17648.gotoNextObject () ;
    }
  }
  outArgument_outAssemblyCode.dotAssign_operation (GALGAS_string (";---\n"
    "\n") COMMA_SOURCE_FILE_AT_LINE (582)) ;
  outArgument_outAssemblyCode.dotAssign_operation (GALGAS_string ("  END\n"
    "\n") COMMA_SOURCE_FILE_AT_LINE (583)) ;
}


//---------------------------------------------------------------------------*
//                                                                           *
//Abstract category method '@pic18_intermediate_instruction buildAssemblyCode'*
//                                                                           *
//---------------------------------------------------------------------------*

static TC_UniqueArray <categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_buildAssemblyCode> gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_buildAssemblyCode ;

//---------------------------------------------------------------------------*

