pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_build_assembly_code.cpp
void enterCategoryMethod_buildAssemblyCode (const PMSInt32 inClassIndex,
                                            categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_buildAssemblyCode inMethod) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_buildAssemblyCode.forceObjectAtIndex (inClassIndex, inMethod, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

static void freeCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_buildAssemblyCode (void) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_buildAssemblyCode.free () ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_buildAssemblyCode (NULL,
                                                                                         freeCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_buildAssemblyCode) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_buildAssemblyCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                           GALGAS_stringlist & io_ioStringList,
                                           GALGAS_uint & io_ioBccLabelIndex,
                                           C_Compiler * inCompiler
                                           COMMA_LOCATION_ARGS) {
//--- Drop output arguments
//--- Find method
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_pic_31__38__5F_intermediate_5F_instruction) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_buildAssemblyCode f = NULL ;
    if (classIndex < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_buildAssemblyCode.count ()) {
      f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_buildAssemblyCode (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_buildAssemblyCode.count ()) {
           f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_buildAssemblyCode (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_buildAssemblyCode.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    if (NULL == f) {
      fatalError ("FATAL CATEGORY METHOD CALL ERROR", __FILE__, __LINE__) ;
    }else{
      f (inObject, io_ioStringList, io_ioBccLabelIndex, inCompiler COMMA_THERE) ;
    }
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//  Overriding category method '@pic18_intermediate_NULL buildAssemblyCode'  *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_NULL_buildAssemblyCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                  GALGAS_stringlist & /* ioArgument_ioStringList */,
                                                                                  GALGAS_uint & /* ioArgument_ioBccLabelIndex */,
                                                                                  C_Compiler * /* inCompiler */
                                                                                  COMMA_UNUSED_LOCATION_ARGS) {
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_NULL_buildAssemblyCode (void) {
  enterCategoryMethod_buildAssemblyCode (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_NULL.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_NULL_buildAssemblyCode) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_NULL_buildAssemblyCode (defineCategoryMethod_pic_31__38__5F_intermediate_5F_NULL_buildAssemblyCode, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_pseudo_ORG buildAssemblyCode'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG_buildAssemblyCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                           GALGAS_stringlist & ioArgument_ioStringList,
                                                                                           GALGAS_uint & /* ioArgument_ioBccLabelIndex */,
                                                                                           C_Compiler * /* inCompiler */
                                                                                           COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG * object = (const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG) ;
  ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  ORG ").operator_concat (object->mAttribute_mOrigin.reader_hexString (SOURCE_FILE_AT_LINE (29)) COMMA_SOURCE_FILE_AT_LINE (29)) COMMA_SOURCE_FILE_AT_LINE (29)) ;
}
//---------------------------------------------------------------------------*

