pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_build_assembly_code.cpp
static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG_buildAssemblyCode (void) {
  enterCategoryMethod_buildAssemblyCode (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG_buildAssemblyCode) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG_buildAssemblyCode (defineCategoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG_buildAssemblyCode, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//  Overriding category method '@pic18_intermediate_word buildAssemblyCode'  *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_word_buildAssemblyCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                  GALGAS_stringlist & ioArgument_ioStringList,
                                                                                  GALGAS_uint & /* ioArgument_ioBccLabelIndex */,
                                                                                  C_Compiler * /* inCompiler */
                                                                                  COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_word * object = (const cPtr_pic_31__38__5F_intermediate_5F_word *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_word) ;
  ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  WORD ").operator_concat (object->mAttribute_mValue.reader_hexString (SOURCE_FILE_AT_LINE (38)) COMMA_SOURCE_FILE_AT_LINE (38)) COMMA_SOURCE_FILE_AT_LINE (38)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_word_buildAssemblyCode (void) {
  enterCategoryMethod_buildAssemblyCode (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_word.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_word_buildAssemblyCode) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_word_buildAssemblyCode (defineCategoryMethod_pic_31__38__5F_intermediate_5F_word_buildAssemblyCode, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_MOV_LABEL_W buildAssemblyCode'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W_buildAssemblyCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                               GALGAS_stringlist & ioArgument_ioStringList,
                                                                                               GALGAS_uint & /* ioArgument_ioBccLabelIndex */,
                                                                                               C_Compiler * /* inCompiler */
                                                                                               COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W * object = (const cPtr_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W) ;
  ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  MOVLW ((").operator_concat (object->mAttribute_mLabel.reader_string (SOURCE_FILE_AT_LINE (47)) COMMA_SOURCE_FILE_AT_LINE (47)).operator_concat (GALGAS_string (" + ") COMMA_SOURCE_FILE_AT_LINE (47)).operator_concat (object->mAttribute_mOffset.reader_string (SOURCE_FILE_AT_LINE (47)) COMMA_SOURCE_FILE_AT_LINE (47)).operator_concat (GALGAS_string (") >> ") COMMA_SOURCE_FILE_AT_LINE (47)).operator_concat (object->mAttribute_mRightShift.reader_string (SOURCE_FILE_AT_LINE (47)) COMMA_SOURCE_FILE_AT_LINE (47)).operator_concat (GALGAS_string (") & 0xFF") COMMA_SOURCE_FILE_AT_LINE (47)) COMMA_SOURCE_FILE_AT_LINE (47)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W_buildAssemblyCode (void) {
  enterCategoryMethod_buildAssemblyCode (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W_buildAssemblyCode) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W_buildAssemblyCode (defineCategoryMethod_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W_buildAssemblyCode, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_pseudo_LABEL buildAssemblyCode'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL_buildAssemblyCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                             GALGAS_stringlist & ioArgument_ioStringList,
                                                                                             GALGAS_uint & /* ioArgument_ioBccLabelIndex */,
                                                                                             C_Compiler * /* inCompiler */
                                                                                             COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL * object = (const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL) ;
  ioArgument_ioStringList.addAssign_operation (object->mAttribute_mLabel.reader_string (SOURCE_FILE_AT_LINE (56)).operator_concat (GALGAS_string (":") COMMA_SOURCE_FILE_AT_LINE (56)) COMMA_SOURCE_FILE_AT_LINE (56)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL_buildAssemblyCode (void) {
  enterCategoryMethod_buildAssemblyCode (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL_buildAssemblyCode) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL_buildAssemblyCode (defineCategoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL_buildAssemblyCode, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_FDA buildAssemblyCode'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FDA_buildAssemblyCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                GALGAS_stringlist & ioArgument_ioStringList,
                                                                                                GALGAS_uint & /* ioArgument_ioBccLabelIndex */,
                                                                                                C_Compiler * inCompiler
                                                                                                COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA) ;
  GALGAS_string var_s = GALGAS_string ("  ").operator_concat (categoryReader_mnemonic (object->mAttribute_mInstruction_5F_FDA_5F_base_5F_code, inCompiler COMMA_SOURCE_FILE_AT_LINE (65)) COMMA_SOURCE_FILE_AT_LINE (65)).operator_concat (GALGAS_string (" ") COMMA_SOURCE_FILE_AT_LINE (65)).operator_concat (object->mAttribute_mRegisterDescription.reader_mAssemblyString (SOURCE_FILE_AT_LINE (65)) COMMA_SOURCE_FILE_AT_LINE (65)) ;
  const enumGalgasBool test_0 = object->mAttribute_m_5F_W_5F_isDestination.operator_and (object->mAttribute_mRegisterDescription.reader_mNeedsBSR (SOURCE_FILE_AT_LINE (66)) COMMA_SOURCE_FILE_AT_LINE (66)).boolEnum () ;
  if (kBoolTrue == test_0) {
    var_s.dotAssign_operation (GALGAS_string (", W, BSR_ACCESS") COMMA_SOURCE_FILE_AT_LINE (67)) ;
  }else if (kBoolFalse == test_0) {
    const enumGalgasBool test_1 = object->mAttribute_mRegisterDescription.reader_mNeedsBSR (SOURCE_FILE_AT_LINE (68)).boolEnum () ;
    if (kBoolTrue == test_1) {
      var_s.dotAssign_operation (GALGAS_string (", F, BSR_ACCESS") COMMA_SOURCE_FILE_AT_LINE (69)) ;
    }else if (kBoolFalse == test_1) {
      const enumGalgasBool test_2 = object->mAttribute_m_5F_W_5F_isDestination.boolEnum () ;
      if (kBoolTrue == test_2) {
        var_s.dotAssign_operation (GALGAS_string (", W") COMMA_SOURCE_FILE_AT_LINE (71)) ;
      }else if (kBoolFalse == test_2) {
        var_s.dotAssign_operation (GALGAS_string (", F") COMMA_SOURCE_FILE_AT_LINE (73)) ;
      }
    }
  }
  ioArgument_ioStringList.addAssign_operation (var_s COMMA_SOURCE_FILE_AT_LINE (75)) ;
}
//---------------------------------------------------------------------------*

