pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_build_assembly_code.cpp
C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FBA_buildAssemblyCode (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FBA_buildAssemblyCode, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_BitTestSkip buildAssemblyCode'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_buildAssemblyCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                        GALGAS_stringlist & ioArgument_ioStringList,
                                                                                                        GALGAS_uint & /* ioArgument_ioBccLabelIndex */,
                                                                                                        C_Compiler * /* inCompiler */
                                                                                                        COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip) ;
  GALGAS_string var_s = GALGAS_string ("  ") ;
  const enumGalgasBool test_0 = object->mAttribute_mSkipIfSet.boolEnum () ;
  if (kBoolTrue == test_0) {
    var_s.dotAssign_operation (GALGAS_string ("BTFSS") COMMA_SOURCE_FILE_AT_LINE (114)) ;
  }else if (kBoolFalse == test_0) {
    var_s.dotAssign_operation (GALGAS_string ("BTFSC") COMMA_SOURCE_FILE_AT_LINE (116)) ;
  }
  var_s.dotAssign_operation (GALGAS_string ("  ").operator_concat (object->mAttribute_mRegisterDescription.reader_mAssemblyString (SOURCE_FILE_AT_LINE (118)) COMMA_SOURCE_FILE_AT_LINE (118)) COMMA_SOURCE_FILE_AT_LINE (118)) ;
  var_s.dotAssign_operation (GALGAS_string (", ").operator_concat (object->mAttribute_mBitNumber.reader_string (SOURCE_FILE_AT_LINE (119)) COMMA_SOURCE_FILE_AT_LINE (119)) COMMA_SOURCE_FILE_AT_LINE (119)) ;
  const enumGalgasBool test_1 = object->mAttribute_mRegisterDescription.reader_mNeedsBSR (SOURCE_FILE_AT_LINE (120)).boolEnum () ;
  if (kBoolTrue == test_1) {
    var_s.dotAssign_operation (GALGAS_string (", BSR_ACCESS") COMMA_SOURCE_FILE_AT_LINE (121)) ;
  }
  ioArgument_ioStringList.addAssign_operation (var_s COMMA_SOURCE_FILE_AT_LINE (123)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_buildAssemblyCode (void) {
  enterCategoryMethod_buildAssemblyCode (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_buildAssemblyCode) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_buildAssemblyCode (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_buildAssemblyCode, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_FA buildAssemblyCode'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FA_buildAssemblyCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                               GALGAS_stringlist & ioArgument_ioStringList,
                                                                                               GALGAS_uint & /* ioArgument_ioBccLabelIndex */,
                                                                                               C_Compiler * inCompiler
                                                                                               COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FA * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FA *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FA) ;
  GALGAS_string var_s = GALGAS_string ("  ").operator_concat (categoryReader_mnemonic (object->mAttribute_mFAinstruction, inCompiler COMMA_SOURCE_FILE_AT_LINE (132)) COMMA_SOURCE_FILE_AT_LINE (132)).operator_concat (GALGAS_string (" ") COMMA_SOURCE_FILE_AT_LINE (132)).operator_concat (object->mAttribute_mRegisterDescription.reader_mAssemblyString (SOURCE_FILE_AT_LINE (132)) COMMA_SOURCE_FILE_AT_LINE (132)) ;
  const enumGalgasBool test_0 = object->mAttribute_mRegisterDescription.reader_mNeedsBSR (SOURCE_FILE_AT_LINE (133)).boolEnum () ;
  if (kBoolTrue == test_0) {
    var_s.dotAssign_operation (GALGAS_string (", BSR_ACCESS") COMMA_SOURCE_FILE_AT_LINE (134)) ;
  }
  ioArgument_ioStringList.addAssign_operation (var_s COMMA_SOURCE_FILE_AT_LINE (136)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FA_buildAssemblyCode (void) {
  enterCategoryMethod_buildAssemblyCode (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FA.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FA_buildAssemblyCode) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FA_buildAssemblyCode (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FA_buildAssemblyCode, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_conditionalBranch buildAssemblyCode'*
//                                                                           *
//---------------------------------------------------------------------------*

