pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_build_assembly_code.cpp
static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_buildAssemblyCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                              GALGAS_stringlist & ioArgument_ioStringList,
                                                                                                              GALGAS_uint & ioArgument_ioBccLabelIndex,
                                                                                                              C_Compiler * inCompiler
                                                                                                              COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch) ;
  if (object->mAttribute_mBranchMode.isValid ()) {
    switch (object->mAttribute_mBranchMode.enumValue ()) {
    case GALGAS_condionalBranchMode::kNotBuilt:
      break ;
    case GALGAS_condionalBranchMode::kEnum_native: case GALGAS_condionalBranchMode::kEnum_ipicNative: {
      ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  ").operator_concat (categoryReader_mnemonic (object->mAttribute_mConditionalBranch, inCompiler COMMA_SOURCE_FILE_AT_LINE (147)) COMMA_SOURCE_FILE_AT_LINE (147)).operator_concat (GALGAS_string (" ") COMMA_SOURCE_FILE_AT_LINE (147)).operator_concat (object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (147)) COMMA_SOURCE_FILE_AT_LINE (147)) COMMA_SOURCE_FILE_AT_LINE (147)) ;
      } break ;
    case GALGAS_condionalBranchMode::kEnum_ipicBRA: {
      GALGAS_conditional_5F_branch var_complementary ;
      {
      routine_getComplementaryBcc (object->mAttribute_mConditionalBranch, var_complementary, inCompiler COMMA_SOURCE_FILE_AT_LINE (150)) ;
      }
      GALGAS_string var_aLabel = GALGAS_string ("_bcc_label_").operator_concat (ioArgument_ioBccLabelIndex.reader_string (SOURCE_FILE_AT_LINE (151)) COMMA_SOURCE_FILE_AT_LINE (151)) ;
      ioArgument_ioBccLabelIndex.increment_operation (inCompiler COMMA_SOURCE_FILE_AT_LINE (151)) ;
      ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  ").operator_concat (categoryReader_mnemonic (var_complementary, inCompiler COMMA_SOURCE_FILE_AT_LINE (152)) COMMA_SOURCE_FILE_AT_LINE (152)).operator_concat (GALGAS_string (" ") COMMA_SOURCE_FILE_AT_LINE (152)).operator_concat (var_aLabel COMMA_SOURCE_FILE_AT_LINE (152)) COMMA_SOURCE_FILE_AT_LINE (152)) ;
      ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  BRA ").operator_concat (object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (153)) COMMA_SOURCE_FILE_AT_LINE (153)) COMMA_SOURCE_FILE_AT_LINE (153)) ;
      ioArgument_ioStringList.addAssign_operation (var_aLabel.operator_concat (GALGAS_string (":") COMMA_SOURCE_FILE_AT_LINE (154)) COMMA_SOURCE_FILE_AT_LINE (154)) ;
      } break ;
    case GALGAS_condionalBranchMode::kEnum_ipicGOTO: {
      GALGAS_conditional_5F_branch var_complementary ;
      {
      routine_getComplementaryBcc (object->mAttribute_mConditionalBranch, var_complementary, inCompiler COMMA_SOURCE_FILE_AT_LINE (157)) ;
      }
      GALGAS_string var_aLabel = GALGAS_string ("_bcc_label_").operator_concat (ioArgument_ioBccLabelIndex.reader_string (SOURCE_FILE_AT_LINE (158)) COMMA_SOURCE_FILE_AT_LINE (158)) ;
      ioArgument_ioBccLabelIndex.increment_operation (inCompiler COMMA_SOURCE_FILE_AT_LINE (158)) ;
      ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  ").operator_concat (categoryReader_mnemonic (var_complementary, inCompiler COMMA_SOURCE_FILE_AT_LINE (159)) COMMA_SOURCE_FILE_AT_LINE (159)).operator_concat (GALGAS_string (" ") COMMA_SOURCE_FILE_AT_LINE (159)).operator_concat (var_aLabel COMMA_SOURCE_FILE_AT_LINE (159)) COMMA_SOURCE_FILE_AT_LINE (159)) ;
      ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  GOTO ").operator_concat (object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (160)) COMMA_SOURCE_FILE_AT_LINE (160)) COMMA_SOURCE_FILE_AT_LINE (160)) ;
      ioArgument_ioStringList.addAssign_operation (var_aLabel.operator_concat (GALGAS_string (":") COMMA_SOURCE_FILE_AT_LINE (161)) COMMA_SOURCE_FILE_AT_LINE (161)) ;
      } break ;
    }
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_buildAssemblyCode (void) {
  enterCategoryMethod_buildAssemblyCode (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_buildAssemblyCode) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_buildAssemblyCode (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_buildAssemblyCode, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_jump_test_register buildAssemblyCode'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_buildAssemblyCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                      GALGAS_stringlist & ioArgument_ioStringList,
                                                                                                      GALGAS_uint & /* ioArgument_ioBccLabelIndex */,
                                                                                                      C_Compiler * /* inCompiler */
                                                                                                      COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register * object = (const cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register) ;
  GALGAS_string var_s = GALGAS_string ("  TSTFSZ ").operator_concat (object->mAttribute_mRegisterDescription.reader_mAssemblyString (SOURCE_FILE_AT_LINE (171)) COMMA_SOURCE_FILE_AT_LINE (171)) ;
  const enumGalgasBool test_0 = object->mAttribute_mRegisterDescription.reader_mNeedsBSR (SOURCE_FILE_AT_LINE (172)).boolEnum () ;
  if (kBoolTrue == test_0) {
    var_s.dotAssign_operation (GALGAS_string (", BSR_ACCESS") COMMA_SOURCE_FILE_AT_LINE (173)) ;
  }
  ioArgument_ioStringList.addAssign_operation (var_s COMMA_SOURCE_FILE_AT_LINE (175)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_buildAssemblyCode (void) {
  enterCategoryMethod_buildAssemblyCode (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_buildAssemblyCode) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_buildAssemblyCode (defineCategoryMethod_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_buildAssemblyCode, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_incDecRegisterInCondition buildAssemblyCode'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_buildAssemblyCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                       GALGAS_stringlist & ioArgument_ioStringList,
                                                                                                       GALGAS_uint & /* ioArgument_ioBccLabelIndex */,
                                                                                                       C_Compiler * /* inCompiler */
                                                                                                       COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition * object = (const cPtr_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition) ;
  GALGAS_string var_s = GALGAS_string::makeEmptyString () ;
  const enumGalgasBool test_0 = object->mAttribute_mBranchIfZero.operator_and (object->mAttribute_mIncrement COMMA_SOURCE_FILE_AT_LINE (201)).boolEnum () ;
  if (kBoolTrue == test_0) {
    var_s.dotAssign_operation (GALGAS_string ("  INFSNZ ") COMMA_SOURCE_FILE_AT_LINE (202)) ;
  }else if (kBoolFalse == test_0) {
    const enumGalgasBool test_1 = object->mAttribute_mBranchIfZero.operator_and (object->mAttribute_mIncrement.operator_not (SOURCE_FILE_AT_LINE (203)) COMMA_SOURCE_FILE_AT_LINE (203)).boolEnum () ;
    if (kBoolTrue == test_1) {
      var_s.dotAssign_operation (GALGAS_string ("  DCFSNZ ") COMMA_SOURCE_FILE_AT_LINE (204)) ;
    }else if (kBoolFalse == test_1) {
      const enumGalgasBool test_2 = object->mAttribute_mBranchIfZero.operator_not (SOURCE_FILE_AT_LINE (205)).operator_and (object->mAttribute_mIncrement COMMA_SOURCE_FILE_AT_LINE (205)).boolEnum () ;
      if (kBoolTrue == test_2) {
        var_s.dotAssign_operation (GALGAS_string ("  INCFSZ ") COMMA_SOURCE_FILE_AT_LINE (206)) ;
      }else if (kBoolFalse == test_2) {
        var_s.dotAssign_operation (GALGAS_string ("  DECFSZ ") COMMA_SOURCE_FILE_AT_LINE (208)) ;
      }
    }
  }
  var_s.dotAssign_operation (object->mAttribute_mRegisterDescription.reader_mAssemblyString (SOURCE_FILE_AT_LINE (210)) COMMA_SOURCE_FILE_AT_LINE (210)) ;
  const enumGalgasBool test_3 = object->mAttribute_m_5F_W_5F_isDestination.operator_and (object->mAttribute_mRegisterDescription.reader_mNeedsBSR (SOURCE_FILE_AT_LINE (211)) COMMA_SOURCE_FILE_AT_LINE (211)).boolEnum () ;
  if (kBoolTrue == test_3) {
    var_s.dotAssign_operation (GALGAS_string (", W, BSR_ACCESS") COMMA_SOURCE_FILE_AT_LINE (212)) ;
  }else if (kBoolFalse == test_3) {
    const enumGalgasBool test_4 = object->mAttribute_mRegisterDescription.reader_mNeedsBSR (SOURCE_FILE_AT_LINE (213)).boolEnum () ;
    if (kBoolTrue == test_4) {
      var_s.dotAssign_operation (GALGAS_string (", F, BSR_ACCESS") COMMA_SOURCE_FILE_AT_LINE (214)) ;
    }else if (kBoolFalse == test_4) {
      const enumGalgasBool test_5 = object->mAttribute_m_5F_W_5F_isDestination.boolEnum () ;
      if (kBoolTrue == test_5) {
        var_s.dotAssign_operation (GALGAS_string (", W") COMMA_SOURCE_FILE_AT_LINE (216)) ;
      }else if (kBoolFalse == test_5) {
        var_s.dotAssign_operation (GALGAS_string (", F") COMMA_SOURCE_FILE_AT_LINE (218)) ;
      }
    }
  }
  ioArgument_ioStringList.addAssign_operation (var_s COMMA_SOURCE_FILE_AT_LINE (220)) ;
  const enumGalgasBool test_6 = object->mAttribute_mUsesBra.boolEnum () ;
  if (kBoolTrue == test_6) {
    ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  BRA ").operator_concat (object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (222)) COMMA_SOURCE_FILE_AT_LINE (222)) COMMA_SOURCE_FILE_AT_LINE (222)) ;
  }else if (kBoolFalse == test_6) {
    ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  GOTO ").operator_concat (object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (224)) COMMA_SOURCE_FILE_AT_LINE (224)) COMMA_SOURCE_FILE_AT_LINE (224)) ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_buildAssemblyCode (void) {
  enterCategoryMethod_buildAssemblyCode (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_buildAssemblyCode) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_buildAssemblyCode (defineCategoryMethod_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_buildAssemblyCode, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_registerComparisonCondition buildAssemblyCode'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_buildAssemblyCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                         GALGAS_stringlist & ioArgument_ioStringList,
                                                                                                         GALGAS_uint & ioArgument_ioBccLabelIndex,
                                                                                                         C_Compiler * inCompiler
                                                                                                         COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition * object = (const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition) ;
  GALGAS_string var_s = GALGAS_string::makeEmptyString () ;
  if (object->mAttribute_mComparison.isValid ()) {
    switch (object->mAttribute_mComparison.enumValue ()) {
    case GALGAS_registerComparison::kNotBuilt:
      break ;
    case GALGAS_registerComparison::kEnum_notEqual: {
      var_s.dotAssign_operation (GALGAS_string ("  CPFSEQ ") COMMA_SOURCE_FILE_AT_LINE (236)) ;
      } break ;
    case GALGAS_registerComparison::kEnum_equal: {
      var_s.dotAssign_operation (GALGAS_string ("  CPFSEQ ") COMMA_SOURCE_FILE_AT_LINE (237)) ;
      } break ;
    case GALGAS_registerComparison::kEnum_greaterOrEqual: {
      var_s.dotAssign_operation (GALGAS_string ("  CPFSLT ") COMMA_SOURCE_FILE_AT_LINE (238)) ;
      } break ;
    case GALGAS_registerComparison::kEnum_greater: {
      var_s.dotAssign_operation (GALGAS_string ("  CPFSGT ") COMMA_SOURCE_FILE_AT_LINE (239)) ;
      } break ;
    case GALGAS_registerComparison::kEnum_lowerOrEqual: {
      var_s.dotAssign_operation (GALGAS_string ("  CPFSGT ") COMMA_SOURCE_FILE_AT_LINE (240)) ;
      } break ;
    case GALGAS_registerComparison::kEnum_lower: {
      var_s.dotAssign_operation (GALGAS_string ("  CPFSLT ") COMMA_SOURCE_FILE_AT_LINE (241)) ;
      } break ;
    }
  }
  var_s.dotAssign_operation (object->mAttribute_mRegisterDescription.reader_mAssemblyString (SOURCE_FILE_AT_LINE (243)) COMMA_SOURCE_FILE_AT_LINE (243)) ;
  const enumGalgasBool test_0 = object->mAttribute_mRegisterDescription.reader_mNeedsBSR (SOURCE_FILE_AT_LINE (244)).boolEnum () ;
  if (kBoolTrue == test_0) {
    var_s.dotAssign_operation (GALGAS_string (", BSR_ACCESS") COMMA_SOURCE_FILE_AT_LINE (245)) ;
  }
  ioArgument_ioStringList.addAssign_operation (var_s COMMA_SOURCE_FILE_AT_LINE (247)) ;
  GALGAS_bool var_usesIntermediateBRA ;
  //--- @selfCopyInExpressionForGeneration
  const GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition temp_1 = object ;
  callCategoryMethod_usesIntermediateBRA ((const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition *) temp_1.ptr (), var_usesIntermediateBRA, inCompiler COMMA_SOURCE_FILE_AT_LINE (248)) ;
  const enumGalgasBool test_2 = var_usesIntermediateBRA.boolEnum () ;
  if (kBoolTrue == test_2) {
    GALGAS_string var_aLabel = GALGAS_string ("_bcc_label_").operator_concat (ioArgument_ioBccLabelIndex.reader_string (SOURCE_FILE_AT_LINE (250)) COMMA_SOURCE_FILE_AT_LINE (250)) ;
    ioArgument_ioBccLabelIndex.increment_operation (inCompiler COMMA_SOURCE_FILE_AT_LINE (250)) ;
    ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  BRA ").operator_concat (var_aLabel COMMA_SOURCE_FILE_AT_LINE (251)) COMMA_SOURCE_FILE_AT_LINE (251)) ;
    const enumGalgasBool test_3 = object->mAttribute_mUsesBra.boolEnum () ;
    if (kBoolTrue == test_3) {
      ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  BRA ").operator_concat (object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (253)) COMMA_SOURCE_FILE_AT_LINE (253)) COMMA_SOURCE_FILE_AT_LINE (253)) ;
    }else if (kBoolFalse == test_3) {
      ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  GOTO ").operator_concat (object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (255)) COMMA_SOURCE_FILE_AT_LINE (255)) COMMA_SOURCE_FILE_AT_LINE (255)) ;
    }
    ioArgument_ioStringList.addAssign_operation (var_aLabel.operator_concat (GALGAS_string (":") COMMA_SOURCE_FILE_AT_LINE (257)) COMMA_SOURCE_FILE_AT_LINE (257)) ;
  }else if (kBoolFalse == test_2) {
    const enumGalgasBool test_4 = object->mAttribute_mUsesBra.boolEnum () ;
    if (kBoolTrue == test_4) {
      ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  BRA ").operator_concat (object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (260)) COMMA_SOURCE_FILE_AT_LINE (260)) COMMA_SOURCE_FILE_AT_LINE (260)) ;
    }else if (kBoolFalse == test_4) {
      ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  GOTO ").operator_concat (object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (262)) COMMA_SOURCE_FILE_AT_LINE (262)) COMMA_SOURCE_FILE_AT_LINE (262)) ;
    }
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_buildAssemblyCode (void) {
  enterCategoryMethod_buildAssemblyCode (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_buildAssemblyCode) ;
}

//---------------------------------------------------------------------------*

