pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_build_assembly_code.cpp
C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_buildAssemblyCode (defineCategoryMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_buildAssemblyCode, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//  Overriding category method '@pic18_intermediate_JUMP buildAssemblyCode'  *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_JUMP_buildAssemblyCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                  GALGAS_stringlist & ioArgument_ioStringList,
                                                                                  GALGAS_uint & /* ioArgument_ioBccLabelIndex */,
                                                                                  C_Compiler * /* inCompiler */
                                                                                  COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_JUMP * object = (const cPtr_pic_31__38__5F_intermediate_5F_JUMP *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_JUMP) ;
  if (object->mAttribute_mKind.isValid ()) {
    switch (object->mAttribute_mKind.enumValue ()) {
    case GALGAS_jumpInstructionKind::kNotBuilt:
      break ;
    case GALGAS_jumpInstructionKind::kEnum_ipicRelative: {
      ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  BRA   ").operator_concat (object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (274)) COMMA_SOURCE_FILE_AT_LINE (274)) COMMA_SOURCE_FILE_AT_LINE (274)) ;
      } break ;
    case GALGAS_jumpInstructionKind::kEnum_ipicAbsolute: {
      ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  GOTO  ").operator_concat (object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (275)) COMMA_SOURCE_FILE_AT_LINE (275)) COMMA_SOURCE_FILE_AT_LINE (275)) ;
      } break ;
    case GALGAS_jumpInstructionKind::kEnum_relative: {
      ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  BRA   ").operator_concat (object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (276)) COMMA_SOURCE_FILE_AT_LINE (276)) COMMA_SOURCE_FILE_AT_LINE (276)) ;
      } break ;
    case GALGAS_jumpInstructionKind::kEnum_absolute: {
      ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  GOTO  ").operator_concat (object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (277)) COMMA_SOURCE_FILE_AT_LINE (277)) COMMA_SOURCE_FILE_AT_LINE (277)) ;
      } break ;
    }
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_JUMP_buildAssemblyCode (void) {
  enterCategoryMethod_buildAssemblyCode (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_JUMP.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_JUMP_buildAssemblyCode) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_JUMP_buildAssemblyCode (defineCategoryMethod_pic_31__38__5F_intermediate_5F_JUMP_buildAssemblyCode, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//  Overriding category method '@pic18_intermediate_JSR buildAssemblyCode'   *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_JSR_buildAssemblyCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                 GALGAS_stringlist & ioArgument_ioStringList,
                                                                                 GALGAS_uint & /* ioArgument_ioBccLabelIndex */,
                                                                                 C_Compiler * /* inCompiler */
                                                                                 COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_JSR * object = (const cPtr_pic_31__38__5F_intermediate_5F_JSR *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_JSR) ;
  if (object->mAttribute_mKind.isValid ()) {
    switch (object->mAttribute_mKind.enumValue ()) {
    case GALGAS_jumpInstructionKind::kNotBuilt:
      break ;
    case GALGAS_jumpInstructionKind::kEnum_ipicRelative: {
      ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  RCALL ").operator_concat (object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (288)) COMMA_SOURCE_FILE_AT_LINE (288)) COMMA_SOURCE_FILE_AT_LINE (288)) ;
      } break ;
    case GALGAS_jumpInstructionKind::kEnum_ipicAbsolute: {
      ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  CALL  ").operator_concat (object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (289)) COMMA_SOURCE_FILE_AT_LINE (289)) COMMA_SOURCE_FILE_AT_LINE (289)) ;
      } break ;
    case GALGAS_jumpInstructionKind::kEnum_relative: {
      ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  RCALL ").operator_concat (object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (290)) COMMA_SOURCE_FILE_AT_LINE (290)) COMMA_SOURCE_FILE_AT_LINE (290)) ;
      } break ;
    case GALGAS_jumpInstructionKind::kEnum_absolute: {
      ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  CALL  ").operator_concat (object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (291)) COMMA_SOURCE_FILE_AT_LINE (291)) COMMA_SOURCE_FILE_AT_LINE (291)) ;
      } break ;
    }
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_JSR_buildAssemblyCode (void) {
  enterCategoryMethod_buildAssemblyCode (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_JSR.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_JSR_buildAssemblyCode) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_JSR_buildAssemblyCode (defineCategoryMethod_pic_31__38__5F_intermediate_5F_JSR_buildAssemblyCode, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_MOVLB buildAssemblyCode'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MOVLB_buildAssemblyCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                  GALGAS_stringlist & ioArgument_ioStringList,
                                                                                                  GALGAS_uint & /* ioArgument_ioBccLabelIndex */,
                                                                                                  C_Compiler * /* inCompiler */
                                                                                                  COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_MOVLB * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_MOVLB *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_MOVLB) ;
  ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  MOVLB ").operator_concat (object->mAttribute_mBankIndex.reader_uint (SOURCE_FILE_AT_LINE (301)).reader_hexString (SOURCE_FILE_AT_LINE (301)) COMMA_SOURCE_FILE_AT_LINE (301)) COMMA_SOURCE_FILE_AT_LINE (301)) ;
}
//---------------------------------------------------------------------------*

