pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_build_assembly_code.cpp
static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MOVLB_buildAssemblyCode (void) {
  enterCategoryMethod_buildAssemblyCode (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_MOVLB.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MOVLB_buildAssemblyCode) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MOVLB_buildAssemblyCode (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MOVLB_buildAssemblyCode, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_CLRWDT buildAssemblyCode'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_CLRWDT_buildAssemblyCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                   GALGAS_stringlist & ioArgument_ioStringList,
                                                                                                   GALGAS_uint & /* ioArgument_ioBccLabelIndex */,
                                                                                                   C_Compiler * /* inCompiler */
                                                                                                   COMMA_UNUSED_LOCATION_ARGS) {
  ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  CLRWDT") COMMA_SOURCE_FILE_AT_LINE (310)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_CLRWDT_buildAssemblyCode (void) {
  enterCategoryMethod_buildAssemblyCode (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_CLRWDT.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_CLRWDT_buildAssemblyCode) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_CLRWDT_buildAssemblyCode (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_CLRWDT_buildAssemblyCode, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_DAW buildAssemblyCode'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_DAW_buildAssemblyCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                GALGAS_stringlist & ioArgument_ioStringList,
                                                                                                GALGAS_uint & /* ioArgument_ioBccLabelIndex */,
                                                                                                C_Compiler * /* inCompiler */
                                                                                                COMMA_UNUSED_LOCATION_ARGS) {
  ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  DAW") COMMA_SOURCE_FILE_AT_LINE (319)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_DAW_buildAssemblyCode (void) {
  enterCategoryMethod_buildAssemblyCode (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_DAW.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_DAW_buildAssemblyCode) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_DAW_buildAssemblyCode (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_DAW_buildAssemblyCode, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_NOP buildAssemblyCode'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_NOP_buildAssemblyCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                GALGAS_stringlist & ioArgument_ioStringList,
                                                                                                GALGAS_uint & /* ioArgument_ioBccLabelIndex */,
                                                                                                C_Compiler * /* inCompiler */
                                                                                                COMMA_UNUSED_LOCATION_ARGS) {
  ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  NOP") COMMA_SOURCE_FILE_AT_LINE (328)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_NOP_buildAssemblyCode (void) {
  enterCategoryMethod_buildAssemblyCode (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_NOP.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_NOP_buildAssemblyCode) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_NOP_buildAssemblyCode (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_NOP_buildAssemblyCode, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_POP buildAssemblyCode'*
//                                                                           *
//---------------------------------------------------------------------------*

