pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_build_assembly_code.cpp
static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_POP_buildAssemblyCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                GALGAS_stringlist & ioArgument_ioStringList,
                                                                                                GALGAS_uint & /* ioArgument_ioBccLabelIndex */,
                                                                                                C_Compiler * /* inCompiler */
                                                                                                COMMA_UNUSED_LOCATION_ARGS) {
  ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  POP") COMMA_SOURCE_FILE_AT_LINE (337)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_POP_buildAssemblyCode (void) {
  enterCategoryMethod_buildAssemblyCode (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_POP.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_POP_buildAssemblyCode) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_POP_buildAssemblyCode (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_POP_buildAssemblyCode, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_PUSH buildAssemblyCode'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_PUSH_buildAssemblyCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                 GALGAS_stringlist & ioArgument_ioStringList,
                                                                                                 GALGAS_uint & /* ioArgument_ioBccLabelIndex */,
                                                                                                 C_Compiler * /* inCompiler */
                                                                                                 COMMA_UNUSED_LOCATION_ARGS) {
  ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  PUSH") COMMA_SOURCE_FILE_AT_LINE (346)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_PUSH_buildAssemblyCode (void) {
  enterCategoryMethod_buildAssemblyCode (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_PUSH.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_PUSH_buildAssemblyCode) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_PUSH_buildAssemblyCode (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_PUSH_buildAssemblyCode, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_RESET buildAssemblyCode'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RESET_buildAssemblyCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                  GALGAS_stringlist & ioArgument_ioStringList,
                                                                                                  GALGAS_uint & /* ioArgument_ioBccLabelIndex */,
                                                                                                  C_Compiler * /* inCompiler */
                                                                                                  COMMA_UNUSED_LOCATION_ARGS) {
  ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  RESET") COMMA_SOURCE_FILE_AT_LINE (355)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RESET_buildAssemblyCode (void) {
  enterCategoryMethod_buildAssemblyCode (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RESET.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RESET_buildAssemblyCode) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RESET_buildAssemblyCode (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RESET_buildAssemblyCode, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_RETURN buildAssemblyCode'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_buildAssemblyCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                   GALGAS_stringlist & ioArgument_ioStringList,
                                                                                                   GALGAS_uint & /* ioArgument_ioBccLabelIndex */,
                                                                                                   C_Compiler * /* inCompiler */
                                                                                                   COMMA_UNUSED_LOCATION_ARGS) {
  ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  RETURN") COMMA_SOURCE_FILE_AT_LINE (364)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_buildAssemblyCode (void) {
  enterCategoryMethod_buildAssemblyCode (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_buildAssemblyCode) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_buildAssemblyCode (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_buildAssemblyCode, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_RETURN_NOT_OPTIMIZABLE buildAssemblyCode'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE_buildAssemblyCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                                         GALGAS_stringlist & ioArgument_ioStringList,
                                                                                                                         GALGAS_uint & /* ioArgument_ioBccLabelIndex */,
                                                                                                                         C_Compiler * /* inCompiler */
                                                                                                                         COMMA_UNUSED_LOCATION_ARGS) {
  ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  RETURN") COMMA_SOURCE_FILE_AT_LINE (373)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE_buildAssemblyCode (void) {
  enterCategoryMethod_buildAssemblyCode (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE_buildAssemblyCode) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE_buildAssemblyCode (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE_buildAssemblyCode, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_RETFIE buildAssemblyCode'*
//                                                                           *
//---------------------------------------------------------------------------*

