pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_build_assembly_code.cpp
static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE_buildAssemblyCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                   GALGAS_stringlist & ioArgument_ioStringList,
                                                                                                   GALGAS_uint & /* ioArgument_ioBccLabelIndex */,
                                                                                                   C_Compiler * /* inCompiler */
                                                                                                   COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE) ;
  GALGAS_string var_s = GALGAS_string ("  RETFIE") ;
  const enumGalgasBool test_0 = object->mAttribute_mFastReturn.boolEnum () ;
  if (kBoolTrue == test_0) {
    var_s.dotAssign_operation (GALGAS_string (" 1") COMMA_SOURCE_FILE_AT_LINE (384)) ;
  }
  ioArgument_ioStringList.addAssign_operation (var_s COMMA_SOURCE_FILE_AT_LINE (386)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE_buildAssemblyCode (void) {
  enterCategoryMethod_buildAssemblyCode (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE_buildAssemblyCode) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE_buildAssemblyCode (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE_buildAssemblyCode, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_SLEEP buildAssemblyCode'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_SLEEP_buildAssemblyCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                  GALGAS_stringlist & ioArgument_ioStringList,
                                                                                                  GALGAS_uint & /* ioArgument_ioBccLabelIndex */,
                                                                                                  C_Compiler * /* inCompiler */
                                                                                                  COMMA_UNUSED_LOCATION_ARGS) {
  ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  SLEEP") COMMA_SOURCE_FILE_AT_LINE (395)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_SLEEP_buildAssemblyCode (void) {
  enterCategoryMethod_buildAssemblyCode (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_SLEEP.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_SLEEP_buildAssemblyCode) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_SLEEP_buildAssemblyCode (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_SLEEP_buildAssemblyCode, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_literalOperation buildAssemblyCode'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_buildAssemblyCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                             GALGAS_stringlist & ioArgument_ioStringList,
                                                                                                             GALGAS_uint & /* ioArgument_ioBccLabelIndex */,
                                                                                                             C_Compiler * inCompiler
                                                                                                             COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation) ;
  ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  ").operator_concat (categoryReader_mnemonic (object->mAttribute_mLiteralInstruction, inCompiler COMMA_SOURCE_FILE_AT_LINE (404)) COMMA_SOURCE_FILE_AT_LINE (404)).operator_concat (GALGAS_string (" ") COMMA_SOURCE_FILE_AT_LINE (404)).operator_concat (object->mAttribute_mLiteralValue.reader_hexString (SOURCE_FILE_AT_LINE (404)) COMMA_SOURCE_FILE_AT_LINE (404)) COMMA_SOURCE_FILE_AT_LINE (404)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_buildAssemblyCode (void) {
  enterCategoryMethod_buildAssemblyCode (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_buildAssemblyCode) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_buildAssemblyCode (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_buildAssemblyCode, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_RETLW buildAssemblyCode'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW_buildAssemblyCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                  GALGAS_stringlist & ioArgument_ioStringList,
                                                                                                  GALGAS_uint & /* ioArgument_ioBccLabelIndex */,
                                                                                                  C_Compiler * /* inCompiler */
                                                                                                  COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW) ;
  ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  RETLW ").operator_concat (object->mAttribute_mLiteralValue.reader_hexString (SOURCE_FILE_AT_LINE (413)) COMMA_SOURCE_FILE_AT_LINE (413)) COMMA_SOURCE_FILE_AT_LINE (413)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW_buildAssemblyCode (void) {
  enterCategoryMethod_buildAssemblyCode (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW_buildAssemblyCode) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW_buildAssemblyCode (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW_buildAssemblyCode, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_LFSR buildAssemblyCode'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_LFSR_buildAssemblyCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                 GALGAS_stringlist & ioArgument_ioStringList,
                                                                                                 GALGAS_uint & /* ioArgument_ioBccLabelIndex */,
                                                                                                 C_Compiler * /* inCompiler */
                                                                                                 COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_LFSR * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_LFSR *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_LFSR) ;
  ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  LFSR ").operator_concat (object->mAttribute_mFSRindex.reader_uint (SOURCE_FILE_AT_LINE (422)).reader_string (SOURCE_FILE_AT_LINE (422)) COMMA_SOURCE_FILE_AT_LINE (422)).operator_concat (GALGAS_string (", ") COMMA_SOURCE_FILE_AT_LINE (422)).operator_concat (object->mAttribute_mValue.reader_hexString (SOURCE_FILE_AT_LINE (422)) COMMA_SOURCE_FILE_AT_LINE (422)) COMMA_SOURCE_FILE_AT_LINE (422)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_LFSR_buildAssemblyCode (void) {
  enterCategoryMethod_buildAssemblyCode (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_LFSR.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_LFSR_buildAssemblyCode) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_LFSR_buildAssemblyCode (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_LFSR_buildAssemblyCode, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_MNOP buildAssemblyCode'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP_buildAssemblyCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                 GALGAS_stringlist & ioArgument_ioStringList,
                                                                                                 GALGAS_uint & /* ioArgument_ioBccLabelIndex */,
                                                                                                 C_Compiler * inCompiler
                                                                                                 COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP) ;
  const enumGalgasBool test_0 = GALGAS_bool (kIsEqual, object->mAttribute_mOccurrenceFactor.reader_uint (SOURCE_FILE_AT_LINE (431)).objectCompare (GALGAS_uint ((PMUInt32) 0U))).boolEnum () ;
  if (kBoolTrue == test_0) {
    GALGAS_location location_1 (object->mAttribute_mOccurrenceFactor.reader_location (HERE)) ; // Implicit use of 'location' reader
    inCompiler->emitSemanticWarning (location_1, GALGAS_string ("No generated code") COMMA_SOURCE_FILE_AT_LINE (432)) ;
  }
  GALGAS_uint var_idx = GALGAS_uint ((PMUInt32) 0U) ;
  if (object->mAttribute_mOccurrenceFactor.reader_uint (SOURCE_FILE_AT_LINE (435)).isValid ()) {
    PMUInt32 variant_13160 = object->mAttribute_mOccurrenceFactor.reader_uint (SOURCE_FILE_AT_LINE (435)).uintValue () ;
    bool loop_13160 = true ;
    while (loop_13160) {
      loop_13160 = GALGAS_bool (kIsStrictInf, var_idx.objectCompare (object->mAttribute_mOccurrenceFactor.reader_uint (SOURCE_FILE_AT_LINE (436)))).isValid () ;
      if (loop_13160) {
        loop_13160 = GALGAS_bool (kIsStrictInf, var_idx.objectCompare (object->mAttribute_mOccurrenceFactor.reader_uint (SOURCE_FILE_AT_LINE (436)))).boolValue () ;
      }
      if (loop_13160 && (0 == variant_13160)) {
        loop_13160 = false ;
        inCompiler->loopRunTimeVariantError (SOURCE_FILE_AT_LINE (435)) ;
      }
      if (loop_13160) {
        variant_13160 -- ;
        ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  NOP") COMMA_SOURCE_FILE_AT_LINE (438)) ;
        var_idx.increment_operation (inCompiler COMMA_SOURCE_FILE_AT_LINE (439)) ;
      }
    }
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP_buildAssemblyCode (void) {
  enterCategoryMethod_buildAssemblyCode (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP_buildAssemblyCode) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP_buildAssemblyCode (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP_buildAssemblyCode, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_TBLRD buildAssemblyCode'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD_buildAssemblyCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                  GALGAS_stringlist & ioArgument_ioStringList,
                                                                                                  GALGAS_uint & /* ioArgument_ioBccLabelIndex */,
                                                                                                  C_Compiler * inCompiler
                                                                                                  COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD) ;
  ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  TBLRD ").operator_concat (categoryReader_mnemonic (object->mAttribute_mOption, inCompiler COMMA_SOURCE_FILE_AT_LINE (449)) COMMA_SOURCE_FILE_AT_LINE (449)) COMMA_SOURCE_FILE_AT_LINE (449)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD_buildAssemblyCode (void) {
  enterCategoryMethod_buildAssemblyCode (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD_buildAssemblyCode) ;
}

//---------------------------------------------------------------------------*

