pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_build_assembly_code.cpp
C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD_buildAssemblyCode (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD_buildAssemblyCode, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_TBLWT buildAssemblyCode'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT_buildAssemblyCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                  GALGAS_stringlist & ioArgument_ioStringList,
                                                                                                  GALGAS_uint & /* ioArgument_ioBccLabelIndex */,
                                                                                                  C_Compiler * inCompiler
                                                                                                  COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT) ;
  ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  TBLWT ").operator_concat (categoryReader_mnemonic (object->mAttribute_mOption, inCompiler COMMA_SOURCE_FILE_AT_LINE (458)) COMMA_SOURCE_FILE_AT_LINE (458)) COMMA_SOURCE_FILE_AT_LINE (458)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT_buildAssemblyCode (void) {
  enterCategoryMethod_buildAssemblyCode (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT_buildAssemblyCode) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT_buildAssemblyCode (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT_buildAssemblyCode, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_computed_retlw buildAssemblyCode'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_buildAssemblyCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                              GALGAS_stringlist & ioArgument_ioStringList,
                                                                                                              GALGAS_uint & /* ioArgument_ioBccLabelIndex */,
                                                                                                              C_Compiler * /* inCompiler */
                                                                                                              COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw) ;
  const enumGalgasBool test_0 = object->mAttribute_mUsesRCALL.boolEnum () ;
  if (kBoolTrue == test_0) {
    ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  RCALL _computed_goto_2") COMMA_SOURCE_FILE_AT_LINE (468)) ;
  }else if (kBoolFalse == test_0) {
    ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  CALL _computed_goto_2") COMMA_SOURCE_FILE_AT_LINE (470)) ;
  }
  cEnumerator_uintlist enumerator_14185 (object->mAttribute_mLiteralValues, kEnumeration_up) ;
  while (enumerator_14185.hasCurrentObject ()) {
    ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  RETLW ").operator_concat (enumerator_14185.current_mValue (HERE).reader_hexString (SOURCE_FILE_AT_LINE (473)) COMMA_SOURCE_FILE_AT_LINE (473)) COMMA_SOURCE_FILE_AT_LINE (473)) ;
    enumerator_14185.gotoNextObject () ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_buildAssemblyCode (void) {
  enterCategoryMethod_buildAssemblyCode (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_buildAssemblyCode) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_buildAssemblyCode (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_buildAssemblyCode, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_computed_bra buildAssemblyCode'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_buildAssemblyCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                            GALGAS_stringlist & ioArgument_ioStringList,
                                                                                                            GALGAS_uint & /* ioArgument_ioBccLabelIndex */,
                                                                                                            C_Compiler * /* inCompiler */
                                                                                                            COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra) ;
  const enumGalgasBool test_0 = object->mAttribute_mUsesRCALL.boolEnum () ;
  if (kBoolTrue == test_0) {
    ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  RCALL _computed_goto_2") COMMA_SOURCE_FILE_AT_LINE (484)) ;
  }else if (kBoolFalse == test_0) {
    ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  CALL _computed_goto_2") COMMA_SOURCE_FILE_AT_LINE (486)) ;
  }
  cEnumerator_lstringlist enumerator_14634 (object->mAttribute_mTargetLabels, kEnumeration_up) ;
  while (enumerator_14634.hasCurrentObject ()) {
    ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  BRA ").operator_concat (enumerator_14634.current_mValue (HERE).reader_string (SOURCE_FILE_AT_LINE (489)) COMMA_SOURCE_FILE_AT_LINE (489)) COMMA_SOURCE_FILE_AT_LINE (489)) ;
    enumerator_14634.gotoNextObject () ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_buildAssemblyCode (void) {
  enterCategoryMethod_buildAssemblyCode (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_buildAssemblyCode) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_buildAssemblyCode (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_buildAssemblyCode, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_computed_goto buildAssemblyCode'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_buildAssemblyCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                             GALGAS_stringlist & ioArgument_ioStringList,
                                                                                                             GALGAS_uint & /* ioArgument_ioBccLabelIndex */,
                                                                                                             C_Compiler * /* inCompiler */
                                                                                                             COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto) ;
  const enumGalgasBool test_0 = object->mAttribute_mUsesRCALL.boolEnum () ;
  if (kBoolTrue == test_0) {
    ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  RCALL _computed_goto_4") COMMA_SOURCE_FILE_AT_LINE (500)) ;
  }else if (kBoolFalse == test_0) {
    ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  CALL _computed_goto_4") COMMA_SOURCE_FILE_AT_LINE (502)) ;
  }
  cEnumerator_lstringlist enumerator_15079 (object->mAttribute_mTargetLabels, kEnumeration_up) ;
  while (enumerator_15079.hasCurrentObject ()) {
    ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  GOTO ").operator_concat (enumerator_15079.current_mValue (HERE).reader_string (SOURCE_FILE_AT_LINE (505)) COMMA_SOURCE_FILE_AT_LINE (505)) COMMA_SOURCE_FILE_AT_LINE (505)) ;
    enumerator_15079.gotoNextObject () ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_buildAssemblyCode (void) {
  enterCategoryMethod_buildAssemblyCode (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_buildAssemblyCode) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_buildAssemblyCode (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_buildAssemblyCode, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_computed_rcall buildAssemblyCode'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_buildAssemblyCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                              GALGAS_stringlist & ioArgument_ioStringList,
                                                                                                              GALGAS_uint & /* ioArgument_ioBccLabelIndex */,
                                                                                                              C_Compiler * inCompiler
                                                                                                              COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall) ;
  const enumGalgasBool test_0 = object->mAttribute_mUsesRCALL.boolEnum () ;
  if (kBoolTrue == test_0) {
    ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  RCALL _computed_goto_4") COMMA_SOURCE_FILE_AT_LINE (516)) ;
  }else if (kBoolFalse == test_0) {
    ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  CALL _computed_goto_4") COMMA_SOURCE_FILE_AT_LINE (518)) ;
  }
  GALGAS_uint var_idx = GALGAS_uint ((PMUInt32) 0U) ;
  cEnumerator_lstringlist enumerator_15545 (object->mAttribute_mTargetLabels, kEnumeration_up) ;
  while (enumerator_15545.hasCurrentObject ()) {
    var_idx.increment_operation (inCompiler COMMA_SOURCE_FILE_AT_LINE (522)) ;
    ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  RCALL ").operator_concat (enumerator_15545.current_mValue (HERE).reader_string (SOURCE_FILE_AT_LINE (523)) COMMA_SOURCE_FILE_AT_LINE (523)) COMMA_SOURCE_FILE_AT_LINE (523)) ;
    const enumGalgasBool test_1 = GALGAS_bool (kIsStrictInf, var_idx.objectCompare (object->mAttribute_mTargetLabels.reader_length (SOURCE_FILE_AT_LINE (524)))).boolEnum () ;
    if (kBoolTrue == test_1) {
      ioArgument_ioStringList.addAssign_operation (GALGAS_string ("  BRA   ").operator_concat (object->mAttribute_mEndOfInstructionLabel COMMA_SOURCE_FILE_AT_LINE (525)) COMMA_SOURCE_FILE_AT_LINE (525)) ;
    }
    enumerator_15545.gotoNextObject () ;
  }
  ioArgument_ioStringList.addAssign_operation (object->mAttribute_mEndOfInstructionLabel.operator_concat (GALGAS_string (":") COMMA_SOURCE_FILE_AT_LINE (528)) COMMA_SOURCE_FILE_AT_LINE (528)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_buildAssemblyCode (void) {
  enterCategoryMethod_buildAssemblyCode (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_buildAssemblyCode) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_buildAssemblyCode (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_buildAssemblyCode, NULL) ;

//--- START OF USER ZONE 2


//--- END OF USER ZONE 2


